Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/G51D.tmx
Source language: en_us
Languages: zh_cn

source: Jack Welch 20
zh_cn: 杰克韦尔奇自传20

source: During my senior year, I was being courted by many different companies. I had lots of good offers.
zh_cn: 到了高年级，我接到了很多公司邀请有很多职位可以选择。

source: But my professors convinced me to go to graduate school.
zh_cn: 但是教授们认为我应该继续深造。

source: I turned down the corporate offers and decided to go to the University of Illinois at Champaign, where I was offered a fellowship.
zh_cn: 因此我推掉了职位，决定去平原市的伊利诺斯州大学学习，它提供了奖学金。

source: The school was consistently ranked among the top five graduate programs in chemical engineering. It was a great school for my major.
zh_cn: 这是国内化学工程方面最好的无所学校之一，对我的专业来说这是一个很好的学校。

source: I had been on campus no more than two weeks when I met a pretty girl and asked her out.
zh_cn: 我到大学不到两周，就遇到一个可人的女孩儿，我约了她出来。

source: Our Saturday night date went so well that we ended up just off a campus parking lot in the woods.
zh_cn: 我们周六的约会非常愉快最后我将车开出了停车场到了树林里。

source: The windows in my VW had gotten foggy when all of a sudden a light flashed through.
zh_cn: 甲壳虫的车窗开始起雾，突然一束光射进来。

source: It was the campus police, and we were caught in an awkward position.
zh_cn: 是校警发现了我们，我们非常尴尬地被抓住了。

source: I froze, terrified of the consequences.
zh_cn: 我吓呆了，怕得要命。

source: In those days, things were quite different.
zh_cn: 在那个时代，这是非同小可。

source: The 1950s were conservation times, and we were in the conservative Midwest.
zh_cn: 20世纪50年代的人很保守，而我们正在最保守的中东部。

source: The police took us both down to the campus station and kept us there until four or five in the morning before sending us home.
zh_cn: 警察将我们带回学校警务室，直到凌晨四五点才放我们出来。

source: My life flashed before me.
zh_cn: 不看的未来在我脑海闪现。

source: I thought I was about to lose everything£ºmy fellowship, my chance to get a graduate degree, my career.
zh_cn: 我想我将失去一切：奖学金、学位、工作机会。

source: But most of all, I thought about my mother's reaction when she found out what I had done.
zh_cn: 但是最重要的是，要是妈妈知道了我的作为，她不知道会有多失望。

source: My fate would be decided after a Monday meeting with the university provost, who would determine the disciplinary action.
zh_cn: 我的命运将在周一院长会议决定。院长将最终决定给我何种处罚。

source: On Sunday morning, I gathered up the nerve to call the chairman of the Chemical Engineering Department, Dr. Harry Drickamer.
zh_cn: 星期天早上，我屏息凝神敲响了化学工程部部长哈瑞德里卡默博士的门。

source: I knew him only by his gruff reputation.
zh_cn: 我根本不认识他，只知道他名声在外。

source: Scared as I was, I thought he was my only hope.
zh_cn: 我如此地害怕，他已成为我最后唯一希望。

source: "Dr. Drickamer,"I said, "I have a real problem.
zh_cn: “德里卡默博士”，我说到，“我遇到大麻烦了。

source: The campus police caught me messing around. I'm devastated by it, and I need help."
zh_cn: 校警抓了我现行，我快被这事毁了，请求您的帮助。”

source: I was practically wetting my pants telling him what had happened.
zh_cn: 我向他讲述了事情的经过，战战兢兢差点尿了裤子。

source: "Damn,"he responded.
zh_cn: “够了！”他回答。

source: "Of all the graduate students I've had here, you are the first guy to do something like that.
zh_cn: “这里这么多年来，我还是头一次遇到你这种事。

source: I' ll take care of this, but you better keep your pants on from now on!"
zh_cn: 这次我会处理，但你今后给我管好你的裤裆！”

source: Whatever Drickamer did saved my butt.
zh_cn: 无论如何，德里卡默总算救了我。

source: I still had to go through a difficult meeting with the provost, but I wasn't thrown out of the school.
zh_cn: 我仍然要参加这个可怕的院长会议，但是我没有被赶出校门。

source: Yet that frightening incident got me much closer to Harry. We formed a wonderful relationship.
zh_cn: 正是这个可怕的事件令我跟哈瑞博士有了联系，我们渐渐建立了深厚的友谊。

source: He, too, treated me like a son.
zh_cn: 他也将我当自己儿子一样看待。

source: We bet on football games. We argued over things in the news.
zh_cn: 我们会为球赛打赌，我们讨论新闻事件。

source: In the hallways, Harry would tease me mercilessly, always ragging me about the Red Sox or my already thinning hair.
zh_cn: 在走廊里，他还会无情地假装梳理我本来就稀疏的头发，还打趣说我像红袜子棒球队员。

source: He became an important influence in my life, a mentor throughout my graduate years.
zh_cn: 他给我的影响贯穿一生，一直是我毕业这么多年来的重视顾问。

source: I needed the help.
zh_cn: 我需要他的鼓励。

source: At Illinois, I wasn't as well prepared as the kids from Brooklyn Polytechnic, Columbia, of Minnesota.
zh_cn: 刚进伊利诺斯州大学，我不如其他来自布鲁克林理工学院、哥伦比亚大学或者明达苏达州大学那些学生那么优秀。

source: So in my first year, I struggled there as well.
zh_cn: 所以一年级的时候，我拼命学习。

source: I had to really fight for my grades. I wasn't by any stretch of the imagination a star.
zh_cn: 我必须为顺利毕业而奋斗，而不是做那个梦想摘到星星的人。
